Tekla Open API Reference for Tekla Structures 2025
BoltAttributes Constructor
Overload List
Name | Description
Bolt.BoltAttributes()
 Creates a new default bolt attributes instance that loads standard attributes.
Bolt.BoltAttributes(String)
 Creates a new bolt attributes instance that loads the specified attributes.
Top
See Also
Reference
Bolt.BoltAttributes Class
Tekla.Structures.Drawing Namespace